index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Differential Topology</title>
<!-- 2013-08-17 Sat 21:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Marco Gualtieri"/>
<link rel="stylesheet" type="text/css" href="stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Differential Topology</h1>

<div id="outline-container-sec-1" class="outline-2 courseinfo">
<h2 id="sec-1">Course information</h2>
<div class="outline-text-2" id="text-1">
<p>
<span class="underline">Code:</span> <a href="http://www.artsandscience.utoronto.ca/ofr/calendar/crs_mat.htm#MAT425H1">MAT425F</a> / <a href="http://www.math.toronto.edu/cms/tentative-2013-2014-graduate-courses-descriptions/#MAT1340HF">MAT1340F</a>  <br/>
   <span class="underline">Instructor:</span> <a href="http://www.math.toronto.edu/mgualt">Marco Gualtieri</a>, office hours by appointment.<br/>
   <span class="underline">Class schedule:</span> W1-3 and R11<br/>
   <span class="underline">Evaluation:</span> <br/>
   <span class="underline">Exams:</span><br/>
</p>

<p>
This course is an introduction to the topological aspects of smooth
spaces in arbitrary dimension.  The main tools will include
transversality theory of smooth maps, Morse theory and basic
Riemannian geometry, as well as surgery theory.  We hope to give a
treatment of 4-dimensional manifolds and Kirby calculus.
Coursework will involve exercises as well as class presentations.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Resources</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="underline">Books</span></h3>
<div class="outline-text-3" id="text-2-1">
<p>
The following is a list of texts which I will be following to
various degrees. These are not required texts in the usual sense,
but they are very beautiful and important texts which it would not
hurt to own a copy of.
</p>

<ul class="org-ul">
<li>Guillemin-Pollack: <i>Differential topology</i>
</li>
<li>Milnor: <i>Topology from the differentiable viewpoint</i>
</li>
<li>Milnor: <i>Morse theory</i>
</li>
<li>Kirby: <i>The topology of 4-manifolds</i>
</li>
<li>Arnol&rsquo;d: <i>Catastrophe theory</i> (1992)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="underline">Related Articles</span></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="http://www.math.toronto.edu/mgualt/Morse%2520Theory/Morse%2520theory%25201990s.pdf">Morse theory in the 1990s</a>, M. Guest.
</li>
<li><a href="http://www.pnas.org/content/early/2011/04/18/1018465108.full.pdf">Morse 2-functions</a>, D. Gay and R. Kirby.
</li>
<li><a href="http://www.gaianxaos.com/pdf/dynamics/zeeman-catastrophe_theory.pdf">Catastrophe Theory</a>, E. Zeeman.
</li>
<li><a href="http://www.phy.bris.ac.uk/people/berry_mv/the_papers/Berry213.pdf">Beyond Rainbows</a>, M. Berry.
</li>
<li><a href="http://www.ams.org/notices/201106/rtx110600804p.pdf">Differential Topology Forty-six Years Later</a>, J. Milnor.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Assignments</h2>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Notes</h2>
</div>
</div>
</body>
</html>
